Tekla Open API Reference for Tekla Structures 2025
PluginCoordinateSystemAttribute Class
 The PluginCoordinateSystemAttribute class is used for defining the coordinate system type for model plug-ins which are using points as an input. The attribute is initialized from the custom attribute [PluginCoordinateSystem(PluginBase.CoordinateSystemType Type)] in the plug-in source. If attribute is not defined or attribute has value PluginBase.CoordinateSystemType.FROM_FIRST_POINT_AND_GLOBAL coordinate system is calculated as earlier. The attribute is used if the first Inputdefinition object contains at least two points (defined by two points, line, face or polygon).
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PluginCoordinateSystemAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PluginCoordinateSystemAttribute : Attribute
Public NotInheritable Class PluginCoordinateSystemAttribute
	Inherits Attribute
The PluginCoordinateSystemAttribute type exposes the following members.
Constructors
Name | Description
PluginCoordinateSystemAttribute(Int32)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
PluginCoordinateSystemAttribute(PluginBase.CoordinateSystemType)
 The custom attribute used to define coordinate system of the plug-in. This is not to be used by itself.
Top
Properties
Name | Description
Type
 Returns the type of the input object dependency.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace